wangnan31415926/nrf5-sdk-15.3.0/examples/ble_peripheral/ble_app_bma250E_TM7711/bma.c
/*******************************************************************************
 * Description: *//**\brief This API is used to get the status of offset
 *
 *
 *
 *
 *  \param unsigned char channel,unsigned char *offset
 *                         Channel ->
 *                   BMA255_X_AXIS     ->      0                           
 *                   BMA255_Y_AXIS     ->      1                            
 *                   BMA255_Z_AXIS     ->      2 
 *                   offset -> Any valid value
 *
 *
 *
 *  \return
 *
 *
 ******************************************************************************/
/* Scheduling:
 *
 *
 *
 * Usage guide:
 *
 *
 * Remarks:
 *
 ******************************************************************************/
BMA255_RETURN_FUNCTION_TYPE bma255_get_offset(unsigned char channel,unsigned char *offset)
   {
   unsigned char data;
   int comres = C_Zero_BMA_U8X;
   if (p_bma255==C_Zero_BMA_U8X)
      {
      comres = E_SMB_NULL_PTR;
      }
   else
      {
      switch (channel)
         {
         case BMA255_X_AXIS:
            comres =BMA250E_ReadReg(BMA255_OFFSET_X_AXIS_REG,&data);
            *offset = data;
            break;
         case BMA255_Y_AXIS:
            comres =BMA250E_ReadReg(BMA255_OFFSET_Y_AXIS_REG,&data);
            *offset = data;
            break;
         case BMA255_Z_AXIS:
            comres =BMA250E_ReadReg(BMA255_OFFSET_Z_AXIS_REG,&data);
            *offset = data;
            break;
         default:
            comres = E_BMA255_OUT_OF_RANGE;
            break;
         }
      }
   return comres;
   }
	 
/************************************************
函数名称:获取传感器数据,直接读取X,Y,Z寄存器
**************************************************/
void BMA253_Timer_Handler(void)
{
	unsigned char accel_data[6] = {0x00};
	unsigned char j = 0;
//	memset(V_BMA255FIFOData_U8R,0,6);

	for(j=0; j<6; j++)
	{
		BMA250E_ReadReg(BMA255_ACC_X12_LSB__REG+j, &V_BMA255FIFOData_U8R[j]);	//read x,y,z accel
	}

}

//读取中断状态，返回值代表当前状态
unsigned char BMA250_interrupt_status(void)
{
	unsigned char i[1];
	BMA250E_ReadReg(BMA255_STATUS1_REG,i);	//read
	i[0]=i[0]&0x04;
	i[0]=i[0]>>2;
	return i[0];

}

void BMA250_clear_interrupt(void)
{
	BMA250E_WriteReg(BMA255_INT_CTRL_REG, 0x1f);
}

///////////////////////////////////////////////////////////////////////////////////////////////////////////
BMA255_RETURN_FUNCTION_TYPE bma255_get_fifo_mode (unsigned char *fifo_mode)
   {
   int comres;
   unsigned char data;
   if (p_bma255==C_Zero_BMA_U8X)
      {
      comres =E_SMB_NULL_PTR ;
      }
   else
      {
      comres =BMA250E_ReadReg(BMA255_FIFO_MODE__REG,&data);
      *fifo_mode = BMA255_GET_BITSLICE(data, BMA255_FIFO_MODE);
      }
   return comres;
   }
BMA255_RETURN_FUNCTION_TYPE bma255_get_fifo_data_sel (unsigned char *data_sel)
   {
   int comres;
   unsigned char data;
   if (p_bma255==C_Zero_BMA_U8X)
      {
      comres =E_SMB_NULL_PTR ;
      }
   else
      {
      comres = BMA250E_ReadReg(BMA255_FIFO_DATA_SELECT__REG,&data);
      *data_sel = BMA255_GET_BITSLICE(data, BMA255_FIFO_DATA_SELECT);
      }
   return comres;
   }	 
BMA255_RETURN_FUNCTION_TYPE bma255_burst_read(unsigned char addr, unsigned char *data, unsigned int len)
   {
   
   
   BMA255_RETURN_FUNCTION_TYPE comres;
   
   if (p_bma255 == BMA255_NULL)
      {
      comres = E_BMA255_NULL_PTR;
      }
   else
      {
      comres =BMA250E_ReadReg_DMWZ(addr, data, len);
      }
   return comres;
   }
	 

/************************************************
函数名称:获取传感器数据,读取FIFO寄存器
**************************************************/
unsigned int BMA255_FIFODAQ(void)
{

   unsigned char v_noofbytestoread_u8r = 0;
 	 v_noofbytestoread_u8r = 6;
   //Read FIFO Data
   bma255_burst_read(0x3F, V_BMA255FIFOData_U8R, v_noofbytestoread_u8r);
}

extern unsigned char bma250Lwp_flag;

void bma_init(void)
{
	unsigned char buf[4];
//	twi_master_init();
	bma255_init(&bma255);
  SCL_();
	bma250_soft_reset();
	
	bma255_set_range(BMA255_RANGE_8G);//设置加速度范围
	bma255_set_bandwidth(BMA255_BW_125HZ);
//	bma255_set_range(BMA255_RANGE_8G);
//	bma255_set_range(BMA255_RANGE_4G);
//	bma255_set_range(BMA255_RANGE_2G);
	
	//单击中断设置
//	BMA250E_WriteReg(BMA255_INT_ENABLE1_REG, 0x20);//设置中断使能
//	BMA250E_WriteReg(BMA255_INT1_PAD_SEL_REG, 0x20);//设置中断引脚init1
//	BMA250E_WriteReg(BMA255_TAP_THRES_REG,0xc1); //设置触发阈值
	//单击中断设置end
	
	//任意运动检测
	BMA250E_WriteReg(BMA255_INT_CTRL_REG, 0x03);//设置中断为锁死模式
	BMA250E_WriteReg(BMA255_SLOPE_THRES_REG, 0x01);//阈值寄存器设置 2g--3.91mg--0x14 4g--7.81mg 8g--15.63mg--0x0f 16g--31.25mg
	BMA250E_WriteReg(BMA255_SLOPE_DURN_REG, 0x00);//当斜率大于阈值，超过slope_dur+1的时间，产生中断
	BMA250E_WriteReg(BMA255_INT1_PAD_SEL_REG, 0x04);//设置中断引脚init1
	BMA250E_WriteReg(BMA255_INT_ENABLE1_REG,0x07); //中断使能设置
	//任意运动检测end
	
	
//	bma255_set_bandwidth(BMA255_BW_15_63HZ);
//	bma255_set_Int_Enable(BMA255_DATA_EN,1);
//	bma255_set_mode(BMA255_MODE_LOWPOWER1);
//	BMA250E_WriteReg(BMA255_MODE_CTRL_REG, 0x56);//设置low power使能
//	BMA250E_WriteReg(BMA255_LOW_NOISE_CTRL_REG, 0x00);//设置lwp1使能
	bma250Lwp_flag=1;//bma工作模式标志置1
	
//	BMA250E_WriteReg(BMA255_FIFO_MODE_REG, 0x80);
//	bma255_set_sleep_dur(BMA255_SLEEP_DUR_25MS);
//	BMA250E_ReadReg_DMWZ(0x00,buf,1);
}


	unsigned char buf_bma[4]={0,0,0,0};
	unsigned char _wakeup_=0x12;
void bma_lowpower(void)
{
	unsigned char success_flag=1;
  unsigned char num=0;


while(success_flag==1)
{
	success_flag=0;
	bma255_init(&bma255);
  SCL_();
	bma250_soft_reset();

//任意运动检测
	buf_bma[0]=0;
	BMA250E_WriteReg(BMA255_INT_CTRL_REG, 0x03);//设置中断为锁死模式
	BMA250E_ReadReg( BMA255_INT_CTRL_REG,buf_bma);
	if(buf_bma[0]!=0x03){success_flag=1;}
	
	buf_bma[0]=0;
	BMA250E_WriteReg(BMA255_SLOPE_THRES_REG, _wakeup_);//阈值寄存器设置 2g--3.91mg--0x14 4g--7.81mg 8g--15.63mg--0x0f 16g--31.25mg
	BMA250E_ReadReg( BMA255_SLOPE_THRES_REG,buf_bma);
	if(buf_bma[0]!=0x12){success_flag=1;}
	
	buf_bma[0]=0;
	BMA250E_WriteReg(BMA255_SLOPE_DURN_REG, 0x00);//当斜率大于阈值，超过slope_dur+1的时间，产生中断
	BMA250E_ReadReg( BMA255_SLOPE_DURN_REG,buf_bma);
	if(buf_bma[0]!=0x00){success_flag=1;}
	
	buf_bma[0]=0;
	BMA250E_WriteReg(BMA255_INT1_PAD_SEL_REG, 0x04);//设置中断引脚init1
	BMA250E_ReadReg( BMA255_INT1_PAD_SEL_REG,buf_bma);
	if(buf_bma[0]!=0x04){success_flag=1;}
	
	buf_bma[0]=0;
	BMA250E_WriteReg( BMA255_INT_ENABLE1_REG,0x07); //中断使能设置
		BMA250E_ReadReg(BMA255_INT_ENABLE1_REG,buf_bma);
	if(buf_bma[0]!=0x07){success_flag=1;}

	buf_bma[0]=0;
	//任意运动检测end
	BMA250E_WriteReg(BMA255_MODE_CTRL_REG, 0x56);//设置low power使能
	BMA250E_ReadReg(BMA255_MODE_CTRL_REG,buf_bma);
	if(buf_bma[0]!=0x56){success_flag=1;}
	
	if(num>250){NVIC_SystemReset();}
	num++;

}


	
	
//	bma255_init(&bma255);
//  SCL_();
//	bma250_soft_reset();
//	
////  bma255_set_bandwidth(BMA255_BW_125HZ);
////	bma255_set_range(BMA255_RANGE_8G);	//设置加速度范围
////任意运动检测
//	BMA250E_WriteReg(BMA255_INT_CTRL_REG, 0x03);//设置中断为锁死模式
//	BMA250E_WriteReg(BMA255_SLOPE_THRES_REG, 0x12);//阈值寄存器设置 2g--3.91mg--0x14 4g--7.81mg 8g--15.63mg--0x0f 16g--31.25mg
//	BMA250E_WriteReg(BMA255_SLOPE_DURN_REG, 0x00);//当斜率大于阈值，超过slope_dur+1的时间，产生中断
//	BMA250E_WriteReg(BMA255_INT1_PAD_SEL_REG, 0x04);//设置中断引脚init1
//	BMA250E_WriteReg(BMA255_INT_ENABLE1_REG,0x07); //中断使能设置
//	//任意运动检测end
//	
//	buf_bma[0]=0;
//	buf_bma[1]=0;
//	BMA250E_WriteReg(BMA255_MODE_CTRL_REG, 0x56);//设置low power使能
//	BMA250E_ReadReg(BMA255_MODE_CTRL_REG,buf_bma);
//	while(buf_bma[0]!=0x56&&buf_bma[1]<=3){
//	BMA250E_WriteReg(BMA255_MODE_CTRL_REG, 0x56);//设置low power使能
//	BMA250E_ReadReg(BMA255_MODE_CTRL_REG,buf_bma);
//	buf_bma[1]++;
//	}

  if(buf_bma[0]==0x56)
	{
		bma250Lwp_flag=0;//bma工作模式标志清零
	}
}





